posts/20-09-dictator-vs-me-vol1-culture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-23 Wed 18:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dictator vs Me (vol 1): Culture</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' type='text/css' href='../css/default.css' />
<link rel='stylesheet' type='text/css' href='../css/style.css' />
<link rel='stylesheet' type='text/css' href='../css/code.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />
</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="../index.html">
    <span class="actondev act">ACT</span><span class="actondev on">ON</span><span class="actondev dev">DEV</span>
  </a>
  <span>Development, philosophy, writing</span>
</div>
<h1 class='title'>Dictator vs Me (vol 1): Culture<br/><span class='subtitle'>Fictional discussions between my dictator alter-ergo and.. me</span><br/><span class='subtitle date'>2020-09-23</span></h1>
</div>
<div id="content">
<ul class="org-ul">
<li>D: I feel like banning pop music.</li>
<li>M: Huh? You woke up grumpy.</li>
<li>D: It's reggaeton that makes me grumpy. Up until recently you had
dumb guys pumping up their music in their car and annoying the
shit out of residents &amp; people walking by.</li>
<li>M: OK, I'll give you that, it is annoying.</li>
<li>D: And now, you have people attaching portable speakers on them
and cranking up the volume while walking or riding their
bicycle. It's like Satan has discovered new ways of torture.</li>
<li>M: Sure, that's annoying as well. But what's up with the banning
thing you said?</li>
<li>D: Well, look: 99% of the time people who do this will put on shitty
pop music. Whatever pop is in that country. May it be reggaeton,
may it be trap, you name it.</li>
<li>M: Go on..</li>
<li>D: So.. I just figured a solution. Whenever a genre becomes
popular (in terms of what they play on the radio etc).. BAN IT!
Make it illegal. Illegal for the radio, illegal for the
bars. Illegal for the internet. Censor it, I don't know. You know
what's funny? The individuals that "listen" to this music would
never go into the trouble of searching for it. They consume
because it's almost shoved down their throats. What on earth would
those people put on their Bluetooth speaker then? I mean, if they
go into the trouble of finding this now-illegal music.. good for
them. I don't approve but, hey, since you like it so much I guess
you have the right of annoying the rest of us from time to time.</li>
<li>[D continues] On the other hand, there are genres of music that
people would not stop listening to even if they got
illegal. The point I want to make is that the majority of the
popular music would go extinct if it were to be illegal. People
would not care to look for it. So.. why not extend this idea and
"ban" everything that becomes popular? It's like a test.</li>
<li>M: I see. But, again, I think you woke up grumpy.</li>
<li>D: Yeah, it's my bed. Remind me to find the manufacturer later, I'll
close down their company. [murmurs the following] Let's see if
anyone would miss them.</li>
</ul>
</div>
<div id="postamble" class="status">
<h2>Comments</h2>
Leave your comments below

<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "20-09-dictator-vs-me-vol1-culture"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
